{
  "types": {
    "ast": 0
  },
  "edge_types": {
    "<pad>": 0,
    "<unk>": 1,
    "type": 2,
    "left": 3,
    "right": 4,
    "name": 5,
    "subscript": 6,
    "expr": 7,
    "lvalue": 8,
    "rvalue": 9,
    "init": 10,
    "args": 11,
    "cond": 12,
    "exprs[0]": 13,
    "block_items[0]": 14,
    "exprs[1]": 15,
    "stmt": 16,
    "block_items[1]": 17,
    "block_items[2]": 18,
    "next": 19,
    "iftrue": 20,
    "exprs[2]": 21,
    "block_items[3]": 22,
    "decl": 23,
    "body": 24,
    "params[0]": 25,
    "params[1]": 26,
    "decls[0]": 27,
    "block_items[4]": 28,
    "block_items[5]": 29,
    "iffalse": 30,
    "field": 31,
    "exprs[3]": 32,
    "ext[0]": 33,
    "ext[1]": 34,
    "ext[2]": 35,
    "block_items[6]": 36,
    "ext[3]": 37,
    "ext[4]": 38,
    "ext[5]": 39,
    "ext[6]": 40,
    "ext[7]": 41,
    "ext[8]": 42,
    "ext[9]": 43,
    "ext[10]": 44,
    "ext[11]": 45,
    "ext[12]": 46,
    "ext[13]": 47,
    "ext[14]": 48,
    "ext[15]": 49,
    "ext[16]": 50,
    "ext[17]": 51,
    "ext[18]": 52,
    "ext[19]": 53,
    "ext[20]": 54,
    "ext[21]": 55,
    "ext[22]": 56,
    "ext[23]": 57,
    "ext[24]": 58,
    "ext[25]": 59,
    "ext[26]": 60,
    "ext[27]": 61,
    "ext[28]": 62,
    "ext[29]": 63,
    "ext[30]": 64,
    "ext[31]": 65,
    "ext[32]": 66,
    "ext[33]": 67,
    "ext[34]": 68,
    "ext[35]": 69,
    "ext[36]": 70,
    "ext[37]": 71,
    "ext[38]": 72,
    "ext[39]": 73,
    "ext[40]": 74,
    "ext[41]": 75,
    "ext[42]": 76,
    "ext[43]": 77,
    "ext[44]": 78,
    "ext[45]": 79,
    "ext[46]": 80,
    "ext[47]": 81,
    "ext[48]": 82,
    "ext[49]": 83,
    "ext[50]": 84,
    "ext[51]": 85,
    "ext[52]": 86,
    "ext[53]": 87,
    "ext[54]": 88,
    "ext[55]": 89,
    "ext[56]": 90,
    "ext[57]": 91,
    "ext[58]": 92,
    "ext[59]": 93,
    "ext[60]": 94,
    "ext[61]": 95,
    "ext[62]": 96,
    "ext[63]": 97,
    "ext[64]": 98,
    "ext[65]": 99,
    "ext[66]": 100,
    "ext[67]": 101,
    "ext[68]": 102,
    "ext[69]": 103,
    "ext[70]": 104,
    "ext[71]": 105,
    "ext[72]": 106,
    "ext[73]": 107,
    "ext[74]": 108,
    "ext[75]": 109,
    "ext[76]": 110,
    "ext[77]": 111,
    "ext[78]": 112,
    "ext[79]": 113,
    "ext[80]": 114,
    "ext[81]": 115,
    "ext[82]": 116,
    "ext[83]": 117,
    "ext[84]": 118,
    "ext[85]": 119,
    "ext[86]": 120,
    "ext[87]": 121,
    "ext[88]": 122,
    "ext[89]": 123,
    "ext[90]": 124,
    "ext[91]": 125,
    "ext[92]": 126,
    "ext[93]": 127,
    "ext[94]": 128,
    "ext[95]": 129,
    "ext[96]": 130,
    "ext[97]": 131,
    "ext[98]": 132,
    "ext[99]": 133,
    "ext[100]": 134,
    "ext[101]": 135,
    "ext[102]": 136,
    "ext[103]": 137,
    "ext[104]": 138,
    "ext[105]": 139,
    "ext[106]": 140,
    "ext[107]": 141,
    "ext[108]": 142,
    "ext[109]": 143,
    "ext[110]": 144,
    "ext[111]": 145,
    "ext[112]": 146,
    "ext[113]": 147,
    "ext[114]": 148,
    "ext[115]": 149,
    "ext[116]": 150,
    "ext[117]": 151,
    "ext[118]": 152,
    "ext[119]": 153,
    "ext[120]": 154,
    "ext[121]": 155,
    "ext[122]": 156,
    "ext[123]": 157,
    "ext[124]": 158,
    "ext[125]": 159,
    "ext[126]": 160,
    "ext[127]": 161,
    "ext[128]": 162,
    "ext[129]": 163,
    "ext[130]": 164,
    "ext[131]": 165,
    "ext[132]": 166,
    "ext[133]": 167,
    "ext[134]": 168,
    "ext[135]": 169,
    "ext[136]": 170,
    "ext[137]": 171,
    "ext[138]": 172,
    "ext[139]": 173,
    "ext[140]": 174,
    "ext[141]": 175,
    "ext[142]": 176,
    "ext[143]": 177,
    "ext[144]": 178,
    "ext[145]": 179,
    "ext[146]": 180,
    "ext[147]": 181,
    "ext[148]": 182,
    "ext[149]": 183,
    "ext[150]": 184,
    "ext[151]": 185,
    "ext[152]": 186,
    "ext[153]": 187,
    "ext[154]": 188,
    "ext[155]": 189,
    "ext[156]": 190,
    "ext[157]": 191,
    "ext[158]": 192,
    "ext[159]": 193,
    "ext[160]": 194,
    "ext[161]": 195,
    "ext[162]": 196,
    "ext[163]": 197,
    "ext[164]": 198,
    "ext[165]": 199,
    "ext[166]": 200,
    "ext[167]": 201,
    "ext[168]": 202,
    "ext[169]": 203,
    "ext[170]": 204,
    "ext[171]": 205,
    "ext[172]": 206,
    "ext[173]": 207,
    "ext[174]": 208,
    "ext[175]": 209,
    "ext[176]": 210,
    "ext[177]": 211,
    "ext[178]": 212,
    "ext[179]": 213,
    "ext[180]": 214,
    "ext[181]": 215,
    "ext[182]": 216,
    "ext[183]": 217,
    "ext[184]": 218,
    "ext[185]": 219,
    "ext[186]": 220,
    "ext[187]": 221,
    "ext[188]": 222,
    "ext[189]": 223,
    "ext[190]": 224,
    "ext[191]": 225,
    "ext[192]": 226,
    "ext[193]": 227,
    "ext[194]": 228,
    "values": 229,
    "enumerators[0]": 230,
    "enumerators[1]": 231,
    "enumerators[2]": 232,
    "enumerators[3]": 233,
    "enumerators[4]": 234,
    "enumerators[5]": 235,
    "ext[195]": 236,
    "ext[196]": 237,
    "params[2]": 238,
    "ext[197]": 239,
    "dim": 240,
    "block_items[7]": 241,
    "block_items[8]": 242,
    "exprs[4]": 243,
    "exprs[5]": 244,
    "block_items[9]": 245,
    "exprs[6]": 246,
    "exprs[7]": 247,
    "exprs[8]": 248,
    "exprs[9]": 249,
    "params[3]": 250,
    "ext[198]": 251,
    "block_items[10]": 252,
    "block_items[11]": 253,
    "to_type": 254,
    "params[4]": 255,
    "block_items[12]": 256,
    "block_items[13]": 257,
    "decls[1]": 258,
    "block_items[14]": 259,
    "decls[2]": 260,
    "ext[199]": 261,
    "ext[200]": 262,
    "block_items[15]": 263,
    "block_items[16]": 264,
    "block_items[17]": 265
  },
  "labels": {
    "mergesort": 0,
    "lcs": 1,
    "scs": 2,
    "heapsort": 3,
    "combsort": 4,
    "gjinv": 5,
    "noise": 6,
    "evolutionary": 7,
    "gauss_eliminate": 8,
    "matrix_transposition": 9,
    "quicksort1": 10,
    "nth_root": 11,
    "cocktailsort": 12,
    "quicksort2": 13,
    "binomial": 14,
    "bogosort": 15,
    "brent": 16,
    "insertionsort": 17,
    "sum": 18,
    "selectionsort": 19,
    "circlesort": 20,
    "matrix_det": 21,
    "bubblesort": 22,
    "ceasar": 23,
    "radixsort": 24,
    "floydWarshall": 25
  },
  "ast": {
    "<pad>": 0,
    "<unk>": 1,
    "<class 'pycparser.c_ast.TypeDecl'>": 2,
    "<class 'pycparser.c_ast.IdentifierType'>": 3,
    "<class 'pycparser.c_ast.Typedef'>": 4,
    "<class 'pycparser.c_ast.ID'>": 5,
    "<class 'pycparser.c_ast.BinaryOp'>": 6,
    "<class 'pycparser.c_ast.Constant'>": 7,
    "<class 'pycparser.c_ast.Decl'>": 8,
    "<class 'pycparser.c_ast.ArrayRef'>": 9,
    "<class 'pycparser.c_ast.Assignment'>": 10,
    "<class 'pycparser.c_ast.Struct'>": 11,
    "<class 'pycparser.c_ast.UnaryOp'>": 12,
    "<class 'pycparser.c_ast.Compound'>": 13,
    "<class 'pycparser.c_ast.ExprList'>": 14,
    "<class 'pycparser.c_ast.PtrDecl'>": 15,
    "<class 'pycparser.c_ast.Enumerator'>": 16,
    "<class 'pycparser.c_ast.FuncCall'>": 17,
    "<class 'pycparser.c_ast.For'>": 18,
    "<class 'pycparser.c_ast.FuncDecl'>": 19,
    "<class 'pycparser.c_ast.FuncDef'>": 20,
    "<class 'pycparser.c_ast.ParamList'>": 21,
    "<class 'pycparser.c_ast.If'>": 22,
    "<class 'pycparser.c_ast.Return'>": 23,
    "<class 'pycparser.c_ast.ArrayDecl'>": 24,
    "<class 'pycparser.c_ast.StructRef'>": 25,
    "<class 'pycparser.c_ast.FileAST'>": 26,
    "<class 'pycparser.c_ast.Enum'>": 27,
    "<class 'pycparser.c_ast.EnumeratorList'>": 28,
    "<class 'pycparser.c_ast.TernaryOp'>": 29,
    "<class 'pycparser.c_ast.Typename'>": 30,
    "<class 'pycparser.c_ast.DeclList'>": 31,
    "<class 'pycparser.c_ast.While'>": 32,
    "<class 'pycparser.c_ast.InitList'>": 33,
    "<class 'pycparser.c_ast.DoWhile'>": 34,
    "<class 'pycparser.c_ast.Break'>": 35,
    "<class 'pycparser.c_ast.Cast'>": 36,
    "<class 'pycparser.c_ast.CompoundLiteral'>": 37,
    "<class 'pycparser.c_ast.Continue'>": 38,
    "<class 'pycparser.c_ast.EmptyStatement'>": 39
  }
}