{
  "types": {
    "ast": 0
  },
  "edge_types": {
    "<pad>": 0,
    "<unk>": 1,
    "type": 2,
    "left": 3,
    "right": 4,
    "name": 5,
    "expr": 6,
    "lvalue": 7,
    "rvalue": 8,
    "subscript": 9,
    "cond": 10,
    "init": 11,
    "args": 12,
    "exprs[0]": 13,
    "block_items[0]": 14,
    "exprs[1]": 15,
    "stmt": 16,
    "block_items[1]": 17,
    "block_items[2]": 18,
    "next": 19,
    "iftrue": 20,
    "block_items[3]": 21,
    "decl": 22,
    "body": 23,
    "exprs[2]": 24,
    "params[0]": 25,
    "decls[0]": 26,
    "params[1]": 27,
    "block_items[4]": 28,
    "field": 29,
    "block_items[5]": 30,
    "iffalse": 31,
    "block_items[6]": 32,
    "ext[0]": 33,
    "ext[1]": 34,
    "ext[2]": 35,
    "ext[3]": 36,
    "ext[4]": 37,
    "ext[5]": 38,
    "ext[6]": 39,
    "ext[7]": 40,
    "ext[8]": 41,
    "ext[9]": 42,
    "ext[10]": 43,
    "ext[11]": 44,
    "ext[12]": 45,
    "ext[13]": 46,
    "ext[14]": 47,
    "ext[15]": 48,
    "ext[16]": 49,
    "ext[17]": 50,
    "ext[18]": 51,
    "ext[19]": 52,
    "ext[20]": 53,
    "ext[21]": 54,
    "ext[22]": 55,
    "ext[23]": 56,
    "ext[24]": 57,
    "ext[25]": 58,
    "ext[26]": 59,
    "ext[27]": 60,
    "ext[28]": 61,
    "ext[29]": 62,
    "ext[30]": 63,
    "ext[31]": 64,
    "ext[32]": 65,
    "ext[33]": 66,
    "ext[34]": 67,
    "ext[35]": 68,
    "ext[36]": 69,
    "ext[37]": 70,
    "ext[38]": 71,
    "ext[39]": 72,
    "ext[40]": 73,
    "ext[41]": 74,
    "ext[42]": 75,
    "ext[43]": 76,
    "ext[44]": 77,
    "ext[45]": 78,
    "ext[46]": 79,
    "ext[47]": 80,
    "ext[48]": 81,
    "ext[49]": 82,
    "ext[50]": 83,
    "ext[51]": 84,
    "ext[52]": 85,
    "ext[53]": 86,
    "ext[54]": 87,
    "ext[55]": 88,
    "ext[56]": 89,
    "ext[57]": 90,
    "ext[58]": 91,
    "ext[59]": 92,
    "ext[60]": 93,
    "ext[61]": 94,
    "ext[62]": 95,
    "ext[63]": 96,
    "ext[64]": 97,
    "ext[65]": 98,
    "ext[66]": 99,
    "ext[67]": 100,
    "ext[68]": 101,
    "ext[69]": 102,
    "ext[70]": 103,
    "ext[71]": 104,
    "ext[72]": 105,
    "ext[73]": 106,
    "ext[74]": 107,
    "ext[75]": 108,
    "ext[76]": 109,
    "ext[77]": 110,
    "ext[78]": 111,
    "ext[79]": 112,
    "ext[80]": 113,
    "ext[81]": 114,
    "ext[82]": 115,
    "ext[83]": 116,
    "ext[84]": 117,
    "ext[85]": 118,
    "ext[86]": 119,
    "ext[87]": 120,
    "ext[88]": 121,
    "ext[89]": 122,
    "ext[90]": 123,
    "ext[91]": 124,
    "ext[92]": 125,
    "ext[93]": 126,
    "ext[94]": 127,
    "ext[95]": 128,
    "ext[96]": 129,
    "ext[97]": 130,
    "ext[98]": 131,
    "ext[99]": 132,
    "ext[100]": 133,
    "ext[101]": 134,
    "ext[102]": 135,
    "ext[103]": 136,
    "ext[104]": 137,
    "ext[105]": 138,
    "ext[106]": 139,
    "ext[107]": 140,
    "ext[108]": 141,
    "ext[109]": 142,
    "ext[110]": 143,
    "ext[111]": 144,
    "ext[112]": 145,
    "ext[113]": 146,
    "ext[114]": 147,
    "ext[115]": 148,
    "ext[116]": 149,
    "ext[117]": 150,
    "ext[118]": 151,
    "ext[119]": 152,
    "ext[120]": 153,
    "ext[121]": 154,
    "ext[122]": 155,
    "ext[123]": 156,
    "ext[124]": 157,
    "ext[125]": 158,
    "ext[126]": 159,
    "ext[127]": 160,
    "ext[128]": 161,
    "ext[129]": 162,
    "ext[130]": 163,
    "ext[131]": 164,
    "ext[132]": 165,
    "ext[133]": 166,
    "ext[134]": 167,
    "ext[135]": 168,
    "ext[136]": 169,
    "ext[137]": 170,
    "ext[138]": 171,
    "ext[139]": 172,
    "ext[140]": 173,
    "ext[141]": 174,
    "ext[142]": 175,
    "ext[143]": 176,
    "ext[144]": 177,
    "ext[145]": 178,
    "ext[146]": 179,
    "ext[147]": 180,
    "ext[148]": 181,
    "ext[149]": 182,
    "ext[150]": 183,
    "ext[151]": 184,
    "ext[152]": 185,
    "ext[153]": 186,
    "ext[154]": 187,
    "ext[155]": 188,
    "ext[156]": 189,
    "ext[157]": 190,
    "ext[158]": 191,
    "ext[159]": 192,
    "ext[160]": 193,
    "ext[161]": 194,
    "ext[162]": 195,
    "ext[163]": 196,
    "ext[164]": 197,
    "ext[165]": 198,
    "ext[166]": 199,
    "ext[167]": 200,
    "ext[168]": 201,
    "ext[169]": 202,
    "ext[170]": 203,
    "ext[171]": 204,
    "ext[172]": 205,
    "ext[173]": 206,
    "ext[174]": 207,
    "ext[175]": 208,
    "ext[176]": 209,
    "ext[177]": 210,
    "ext[178]": 211,
    "ext[179]": 212,
    "ext[180]": 213,
    "ext[181]": 214,
    "ext[182]": 215,
    "ext[183]": 216,
    "ext[184]": 217,
    "ext[185]": 218,
    "ext[186]": 219,
    "ext[187]": 220,
    "ext[188]": 221,
    "ext[189]": 222,
    "ext[190]": 223,
    "ext[191]": 224,
    "ext[192]": 225,
    "ext[193]": 226,
    "ext[194]": 227,
    "values": 228,
    "enumerators[0]": 229,
    "enumerators[1]": 230,
    "enumerators[2]": 231,
    "enumerators[3]": 232,
    "enumerators[4]": 233,
    "enumerators[5]": 234,
    "ext[195]": 235,
    "ext[196]": 236,
    "exprs[3]": 237,
    "dim": 238,
    "params[2]": 239,
    "ext[197]": 240,
    "block_items[7]": 241,
    "exprs[4]": 242,
    "block_items[8]": 243,
    "exprs[5]": 244,
    "exprs[6]": 245,
    "exprs[7]": 246,
    "exprs[8]": 247,
    "exprs[9]": 248,
    "block_items[9]": 249,
    "decls[1]": 250,
    "params[3]": 251,
    "block_items[10]": 252,
    "block_items[11]": 253,
    "block_items[12]": 254,
    "block_items[13]": 255,
    "ext[198]": 256,
    "to_type": 257,
    "params[4]": 258,
    "decls[2]": 259,
    "block_items[14]": 260,
    "block_items[15]": 261,
    "block_items[16]": 262,
    "block_items[17]": 263,
    "ext[199]": 264,
    "ext[200]": 265
  },
  "labels": {
    "ceasar": 0,
    "circlesort": 1,
    "bubblesort": 2,
    "cocktailsort": 3,
    "brent": 4,
    "quicksort1": 5,
    "selectionsort": 6,
    "floydWarshall": 7,
    "gauss_eliminate": 8,
    "gjinv": 9,
    "lcs": 10,
    "insertionsort": 11,
    "matrix_det": 12,
    "mergesort": 13,
    "matrix_transposition": 14,
    "combsort": 15,
    "scs": 16,
    "nth_root": 17,
    "radixsort": 18,
    "binomial": 19,
    "evolutionary": 20,
    "quicksort2": 21,
    "bogosort": 22,
    "noise": 23,
    "heapsort": 24
  },
  "ast": {
    "<pad>": 0,
    "<unk>": 1,
    "<class 'pycparser.c_ast.TypeDecl'>": 2,
    "<class 'pycparser.c_ast.IdentifierType'>": 3,
    "<class 'pycparser.c_ast.Typedef'>": 4,
    "<class 'pycparser.c_ast.ID'>": 5,
    "<class 'pycparser.c_ast.Constant'>": 6,
    "<class 'pycparser.c_ast.BinaryOp'>": 7,
    "<class 'pycparser.c_ast.Decl'>": 8,
    "<class 'pycparser.c_ast.Assignment'>": 9,
    "<class 'pycparser.c_ast.Struct'>": 10,
    "<class 'pycparser.c_ast.ArrayRef'>": 11,
    "<class 'pycparser.c_ast.UnaryOp'>": 12,
    "<class 'pycparser.c_ast.PtrDecl'>": 13,
    "<class 'pycparser.c_ast.Compound'>": 14,
    "<class 'pycparser.c_ast.Enumerator'>": 15,
    "<class 'pycparser.c_ast.ExprList'>": 16,
    "<class 'pycparser.c_ast.FuncCall'>": 17,
    "<class 'pycparser.c_ast.For'>": 18,
    "<class 'pycparser.c_ast.FuncDecl'>": 19,
    "<class 'pycparser.c_ast.FuncDef'>": 20,
    "<class 'pycparser.c_ast.If'>": 21,
    "<class 'pycparser.c_ast.ParamList'>": 22,
    "<class 'pycparser.c_ast.Return'>": 23,
    "<class 'pycparser.c_ast.StructRef'>": 24,
    "<class 'pycparser.c_ast.ArrayDecl'>": 25,
    "<class 'pycparser.c_ast.FileAST'>": 26,
    "<class 'pycparser.c_ast.Enum'>": 27,
    "<class 'pycparser.c_ast.EnumeratorList'>": 28,
    "<class 'pycparser.c_ast.Typename'>": 29,
    "<class 'pycparser.c_ast.TernaryOp'>": 30,
    "<class 'pycparser.c_ast.DeclList'>": 31,
    "<class 'pycparser.c_ast.While'>": 32,
    "<class 'pycparser.c_ast.InitList'>": 33,
    "<class 'pycparser.c_ast.DoWhile'>": 34,
    "<class 'pycparser.c_ast.Break'>": 35,
    "<class 'pycparser.c_ast.Cast'>": 36,
    "<class 'pycparser.c_ast.Continue'>": 37,
    "<class 'pycparser.c_ast.CompoundLiteral'>": 38,
    "<class 'pycparser.c_ast.EmptyStatement'>": 39
  }
}